test/cassettes/shipments/refund.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"from_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"}}'
    response:
        status:
            http_version: '2'
            code: '201'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 888f661162015c6ae7875102004b89ab
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_3132f1f5084c47fd9347b6a7d2a8c503
            content-type: 'application/json; charset=utf-8'
            content-length: '6919'
            etag: 'W/"f7aba1319b62df7f995abb0d563a80e4"'
            x-request-id: 2ae62ff5-0229-4224-b716-bdc531a66303
            x-runtime: '1.172183'
            x-node: bigweb2nuq
            x-version-label: easypost-202202042220-76f9648007-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 88c34981dc', 'extlb1nuq 88c34981dc']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-02-07T17:52:42Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100895232106014926","updated_at":"2022-02-07T17:52:43Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_bf7d346f883e11ecb5d7ac1f6bc7b362","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_cfc9cb43a13c444f98311bf60120ef52","object":"Parcel","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","length":10.0,"width":8.0,"height":4.0,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_6f12ac7aa68b445082406b94b7ed615e","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","date_advance":0,"integrated_form":"none","label_date":"2022-02-07T17:52:43Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image/png","label_url":"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20220207/f0b8f0168ede4080a11a14cd5399ac84.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_addaaa912834432f93fafc943b8e4ec5","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e9f45707053041b997c25994ec17207b","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_01bea43fb2e04d7292fb9037101c1dbd","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_1751241ee8454e378b9a035ac2e4be9e","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_1751241ee8454e378b9a035ac2e4be9e","object":"Rate","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_f2d51ae6dffa4c2186f7da5ab913d73e","object":"Tracker","mode":"test","tracking_code":"9400100895232106014926","status":"unknown","status_detail":"unknown","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https://track.easypost.com/djE6dHJrX2YyZDUxYWU2ZGZmYTRjMjE4NmY3ZGE1YWI5MTNkNzNl"},"to_address":{"id":"adr_bf7b7018883e11ecaa5dac1f6bc7bdc6","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_bf7d346f883e11ecb5d7ac1f6bc7b362","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"buyer_address":{"id":"adr_bf7b7018883e11ecaa5dac1f6bc7bdc6","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 837
            request_size: 556
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.375754
            namelookup_time: 0.001134
            connect_time: 0.05939
            pretransfer_time: 0.14333
            size_upload: 528.0
            size_download: 6919.0
            speed_download: 5029.0
            speed_upload: 383.0
            download_content_length: 6919.0
            upload_content_length: 528.0
            starttransfer_time: 0.143346
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.6
            local_port: 51807
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 143192
            connect_time_us: 59390
            namelookup_time_us: 1134
            pretransfer_time_us: 143330
            redirect_time_us: 0
            starttransfer_time_us: 143346
            total_time_us: 1375754
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_3132f1f5084c47fd9347b6a7d2a8c503/refund'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
    response:
        status:
            http_version: '2'
            code: '200'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 888f660f62015c6be7875103004b8a21
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8060'
            etag: 'W/"e676accfa0deaf97c15df5a3ce3ef2f5"'
            x-request-id: 1a864035-8bab-42c7-8154-490d5a8b2470
            x-runtime: '0.177460'
            x-node: bigweb3nuq
            x-version-label: easypost-202202042220-76f9648007-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 88c34981dc', 'extlb1nuq 88c34981dc']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-02-07T17:52:42Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100895232106014926","updated_at":"2022-02-07T17:52:43Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_bf7d346f883e11ecb5d7ac1f6bc7b362","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_cfc9cb43a13c444f98311bf60120ef52","object":"Parcel","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","length":10.0,"width":8.0,"height":4.0,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_6f12ac7aa68b445082406b94b7ed615e","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","date_advance":0,"integrated_form":"none","label_date":"2022-02-07T17:52:43Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image/png","label_url":"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20220207/f0b8f0168ede4080a11a14cd5399ac84.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_addaaa912834432f93fafc943b8e4ec5","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e9f45707053041b997c25994ec17207b","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_01bea43fb2e04d7292fb9037101c1dbd","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_1751241ee8454e378b9a035ac2e4be9e","object":"Rate","created_at":"2022-02-07T17:52:42Z","updated_at":"2022-02-07T17:52:42Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":"submitted","scan_form":null,"selected_rate":{"id":"rate_1751241ee8454e378b9a035ac2e4be9e","object":"Rate","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_f2d51ae6dffa4c2186f7da5ab913d73e","object":"Tracker","mode":"test","tracking_code":"9400100895232106014926","status":"pre_transit","status_detail":"status_update","created_at":"2022-02-07T17:52:43Z","updated_at":"2022-02-07T17:52:43Z","signed_by":null,"weight":null,"est_delivery_date":"2022-02-07T17:52:43Z","shipment_id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-01-07T17:52:43Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-01-08T06:29:43Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https://track.easypost.com/djE6dHJrX2YyZDUxYWU2ZGZmYTRjMjE4NmY3ZGE1YWI5MTNkNzNl"},"to_address":{"id":"adr_bf7b7018883e11ecaa5dac1f6bc7bdc6","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_bf7d346f883e11ecb5d7ac1f6bc7b362","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"buyer_address":{"id":"adr_bf7b7018883e11ecaa5dac1f6bc7bdc6","object":"Address","created_at":"2022-02-07T17:52:42+00:00","updated_at":"2022-02-07T17:52:42+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_3132f1f5084c47fd9347b6a7d2a8c503","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_3132f1f5084c47fd9347b6a7d2a8c503/refund'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 771
            request_size: 578
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.560229
            namelookup_time: 0.001139
            connect_time: 0.059338
            pretransfer_time: 0.322454
            size_upload: 0.0
            size_download: 8060.0
            speed_download: 14386.0
            speed_upload: 0.0
            download_content_length: 8060.0
            upload_content_length: 0.0
            starttransfer_time: 0.560161
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.131
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.6
            local_port: 51808
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 322160
            connect_time_us: 59338
            namelookup_time_us: 1139
            pretransfer_time_us: 322454
            redirect_time_us: 0
            starttransfer_time_us: 560161
            total_time_us: 560229
